v2206/multiphase_boilingBubbles/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.20;

width   0.2;
height  0.8;

vertices
(
    (0      0       0)
    ($width 0       0)
    ($width $height 0)
    (0      $height 0)
    (0      0       1)
    ($width 0       1)
    ($width $height 1)
    (0      $height 1)
);

blocks
(
    // hex (0 1 2 3 4 5 6 7) (60 50 1) simpleGrading (3 1 1)
    
    hex (0 1 2 3 4 5 6 7) (128 256 1) 
    simpleGrading ( 1 1 1 )

    // hex (0 1 2 3 4 5 6 7) (64 256 1) 
    // simpleGrading 
    // (
    //     1
    //     (
    //         (0.20   0.3     5)
    //         (0.80   0.7     1)
    //     )
    //     1
    // )

);


boundary
(
    bottom
    {
        type    wall;
        faces
        (
            (1 5 4 0)
        );
    }
    top
    {
        type    patch;
        faces
        (
            (3 7 6 2)
        );
    }
    left
    {
        type    wall;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type    wall;
        faces
        (
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type    empty;
        faces
        (
            (4 5 6 7)
            (0 1 2 3)
        );
    }
);


// vertices
// (
//     (0 0 0)
//     (0.1 0 0)
//     (0.1 0.45 0)
//     (0 0.45 0)
//     (0 0 1)
//     (0.1 0 1)
//     (0.1 0.45 1)
//     (0 0.45 1)
// );

// blocks
// (
//     hex (0 1 2 3 4 5 6 7) (120 180 1) simpleGrading (1 1 1)
// );


// boundary
// (
//     bottom
//     {
//         type    wall;
//         faces
//         (
//             (1 5 4 0)
//         );
//     }
//     top
//     {
//         type    patch;
//         faces
//         (
//             (3 7 6 2)
//         );
//     }
//     left
//     {
//         type    wall;
//         faces
//         (
//             (0 4 7 3)
//         );
//     }
//     right
//     {
//         type    wall;
//         faces
//         (
//             (2 6 5 1)
//         );
//     }
//     frontAndBack
//     {
//         type    empty;
//         faces
//         (
//             (4 5 6 7)
//             (0 1 2 3)
//         );
//     }
// );



// ************************************************************************* //
